OpenFOAM-2.4.0/tutorials/incompressible/pimpleDyMFoam/oscillatingInletACMI2D/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
//        type            fixedValue;
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    ACMI1_blockage
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
    ACMI2_blockage
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
